---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SurfacePatternIdParam
source: html/32f1d12d-06fd-bcac-a339-32a4c04c4a48.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SurfacePatternIdParam Property

"Surface fill pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId SurfacePatternIdParam { get; }
```